app/Controllers/team.php

INSERT INTO `teams` (`nama`, `bio`, `alamat`, `kontak`, `facebook`, `instagram`, `youtube`, `poto`) VALUES ('bang bre', 'dsdfgdfghfgh', 'jakarta', '021232323', 'fb', 'insta', 'you', 'WhatsApp Image 2023-08-01 at 14.55.13.jpeg')
---
    public function tambahteam()
    {

        $filegambar =$this->request->getFile('logo');
        $filegambar->move('assets/img/team');
        $namagambar = $filegambar->getName();

            $save = new teamModel();
            $save->insert(
            [
                'nama'=>$this->request->getVar('nama'),
                'bio'=>$this->request->getVar('bio'),
                'alamat'=>$this->request->getVar('alamat'),
                'kontak'=>$this->request->getVar('kontak'),
                'facebook'=>$this->request->getVar('facebook'),
                'instagram'=>$this->request->getVar('instagram'),
                'youtube'=>$this->request->getVar('youtube'),
                'poto'=>$namagambar

            ]);