app/Models/bannerModel.php

SELECT *
FROM `banner`
---
    public function getbanner($id= false)
    {

            if ($id == false) {
                return $this->findAll();