app/Models/portfolioModel.php

SELECT *
FROM `portfolio`
---
    public function getdata($id=false)
    {
        if($id==false){
            return $this->findAll();