app/Models/rekananModel.php

    public function getrekanan($id= false)
    {

            if ($id == false) {
                return $this->findAll();
---
SELECT *
FROM `rekanan`