app/Models/serviceModel.php

    public function getservice($id=false)
    {
        if($id==false){
            return $this->findAll();
---
SELECT *
FROM `service`