app/Models/teamModel.php

SELECT *
FROM `teams`
---
    public function getteam($id= false)
    {

            if ($id == false) {
                return $this->findAll();